УТ/src/InformationRegisters/РаспоряженияНаОтгрузкуИВозвратКВыполнению/РаспоряженияНаОтгрузкуИВозвратКВыполнению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспоряженияНаОтгрузкуИВозвратКВыполнению</name>
  <resources>
    <name>СостояниеЗаказано</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКОформлению</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКОтгрузке</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЗаявленоНаВозврат</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКОформлениюПоВозвратам</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКПриемке</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКПереходуПраваСобственности</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКОформлениюСчетовФактур</name>
    <type>
      <types>EnumRef.СостояниеОформленияДокументовПоРаспоряжению</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/AccumulationRegisters/УдалитьЗаявкиНаВозвратТоваровОтКлиентов/УдалитьЗаявкиНаВозвратТоваровОтКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УдалитьЗаявкиНаВозвратТоваровОтКлиентов</name>
  <resources>
    <name>Заявлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаВозвратТоваровОтКлиента</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ/src/AccumulationRegisters/УдалитьРаспоряженияНаОтгрузку/УдалитьРаспоряженияНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УдалитьРаспоряженияНаОтгрузку</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Заказано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПередаче</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвиженияРегистра</name>
    <type>
      <types>EnumRef.ВидыДвиженияНакопления</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ/src/AccumulationRegisters/РаспоряженияНаОтгрузкуИВозврат/РаспоряженияНаОтгрузкуИВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РаспоряженияНаОтгрузкуИВозврат</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>EnumRef.ПоказателиРаспоряженийНаОтгрузкуИВозврат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ/src/Enums/ПоказателиРаспоряженийНаОтгрузкуИВозврат/ПоказателиРаспоряженийНаОтгрузкуИВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиРаспоряженийНаОтгрузкуИВозврат</name>
  <enumValues>
    <name>Заказано</name>
  </enumValues>
  <enumValues>
    <name>ЗаявленоНаВозврат</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>КОформлению</name>
  </enumValues>
  <enumValues>
    <name>Оформлено</name>
  </enumValues>
  <enumValues>
    <name>КОформлениюПоВозвратам</name>
  </enumValues>
  <enumValues>
    <name>ОформленоПоВозвратам</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>КПриемке</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>ПринятоПоВозвратам</name>
  </enumValues>
  <enumValues>
    <name>СписаноДоППС</name>
  </enumValues>
  <enumValues>
    <name>ОприходованоДоППС</name>
  </enumValues>
  <enumValues>
    <name>ОформленоСчетовФактур</name>
  </enumValues>
  <enumValues>
    <name>Скорректировано</name>
  </enumValues>
</mdclass:Enum>

УТ/src/InformationRegisters/РаспоряженияНаОтгрузкуИВозвратКВыполнению/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.70";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f4144f60-c045-4621-811d-3b729a1ee3da");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Исправление состояний документов ""Заявка на возврат товаров от клиента""'");
	
	Читаемые = Новый Массив; // Массив Из Строка
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РаспоряженияНаОтгрузкуИВозврат.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив; // Массив Из Строка
	Изменяемые.Добавить(Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

// Регистрирует документы к обработке для изменения.
//
// Параметры:
//	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяДокумента = "Документ.ЗаявкаНаВозвратТоваровОтКлиента";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПолноеИмяДокумента;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРегистра.ЗаявкаНаВозвратТоваровОтКлиента КАК Распоряжение
	|ИЗ
	|	РегистрНакопления.УдалитьЗаявкиНаВозвратТоваровОтКлиентов КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ЗаявкаНаВозвратТоваровОтКлиента НЕ В
	|		(ВЫБРАТЬ
	|			ТаблицаОстатков.ЗаявкаНаВозвратТоваровОтКлиента
	|		ИЗ
	|			РегистрНакопления.УдалитьЗаявкиНаВозвратТоваровОтКлиентов.Остатки() КАК ТаблицаОстатков)
	|	И ТаблицаРегистра.ЗаявкаНаВозвратТоваровОтКлиента НЕ В
	|		(ВЫБРАТЬ
	|			ТаблицаРаспоряжений.Распоряжение
	|		ИЗ
	|			РегистрНакопления.УдалитьРаспоряженияНаОтгрузку.Обороты(,,,
	|				ТИПЗНАЧЕНИЯ(Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента)) КАК ТаблицаРаспоряжений)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаОборотов.Распоряжение КАК Распоряжение
	|ИЗ
	|	РегистрНакопления.РаспоряженияНаОтгрузкуИВозврат.Обороты(,,, Распоряжение В
	|		(ВЫБРАТЬ
	|			Распоряжение
	|		ИЗ
	|			РегистрСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению
	|		ГДЕ
	|			ТИПЗНАЧЕНИЯ(Распоряжение) = ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента))
	|	И Показатель В (ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлению),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Оформлено),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОтгрузке),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Отгружено),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлениюПоВозвратам),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ОформленоПоВозвратам),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КПриемке),
	|		ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ПринятоПоВозвратам))) КАК ТаблицаОборотов
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОборотов.Распоряжение
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОтгрузке)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Отгружено)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0
	|	И СУММА(ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлению)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.Оформлено)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0
	|	И СУММА(ВЫБОР
	|		КОГДА
	|			ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КОформлениюПоВозвратам)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА
	|			ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ОформленоПоВозвратам)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0
	|	И СУММА(ВЫБОР
	|		КОГДА ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.КПриемке)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА
	|			ТаблицаОборотов.Показатель = ЗНАЧЕНИЕ(Перечисление.ПоказателиРаспоряженийНаОтгрузкуИВозврат.ПринятоПоВозвратам)
	|			ТОГДА ТаблицаОборотов.КоличествоОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ) = 0";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
		Параметры,
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Распоряжение"));
	
КонецПроцедуры

// Обработчик обновления
//
// Параметры:
//	Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Для Каждого ТекущиеДанные Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Распоряжение.Установить(ТекущиеДанные.Ссылка);
			НаборЗаписей.Записать();
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ТекущиеДанные.Ссылка);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ТекущиеДанные.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь,
		Метаданные.РегистрыСведений.РаспоряженияНаОтгрузкуИВозвратКВыполнению.ПолноеИмя());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
